---
layout: post
title: "EIGRP ëª…ë ¹ì–´"
date: 2025-08-10
categories:
  - "CISCO_STUDY/Quick Guide/cli ëª…ë ¹ì–´"
tags:
---

# EIGRP ëª…ë ¹ì–´

## âœ… EIGRP ì „í†µ ëª¨ë“œ(Classic Mode)

### â–¶ êµ¬ì„± ìˆœì„œ ì˜ˆì‹œ

```bash
bash
ë³µì‚¬í¸ì§‘
router(config)# router eigrp [AS-number]
router(config-router)# eigrp router-id [Loopback IP]
router(config-router)# network [IP address] [Wildcard]
router(config-router)# passive-interface default
router(config-router)# no passive-interface [Interface]

```

### â–¶ ì¸ì ‘ ê´€ê³„ ìœ ì§€ ì„¤ì •

```bash
bash
ë³µì‚¬í¸ì§‘
router(config-if)# ip hello-interval eigrp [AS-number] [Seconds]
router(config-if)# ip hold-time eigrp [AS-number] [Seconds]

```

### â–¶ ì¸í„°í˜ì´ìŠ¤ ëŒ€ì—­í­ ì„¤ì • (metric ê³„ì‚°ìš©)

```bash
bash
ë³µì‚¬í¸ì§‘
router(config-if)# bandwidth [kbps]

```

### â–¶ ìš”ì•½ ë¼ìš°íŒ… ì„¤ì •

```bash
bash
ë³µì‚¬í¸ì§‘
router(config-if)# ip summary-address eigrp [AS-number] [IP] [Subnet Mask]

```

### â–¶ ì£¼ìš” í™•ì¸ ëª…ë ¹ì–´

```bash
bash
ë³µì‚¬í¸ì§‘
show ip eigrp interfaces
show ip eigrp topology all-links

```

---

## âœ… EIGRP Named ëª¨ë“œ

### â–¶ ê¸°ë³¸ êµ¬ì„± ë‹¨ê³„

```bash
bash
ë³µì‚¬í¸ì§‘
router(config)# router eigrp [NAME]
router(config-router)# address-family ipv4 unicast autonomous-system [AS-number]
router(config-router-af)# network [IP address] [Wildcard]

```

### â–¶ ì¸í„°í˜ì´ìŠ¤ë³„ ì„¤ì • (AF-Interface Mode)

```bash
bash
ë³µì‚¬í¸ì§‘
router(config-router-af)# af-interface [Interface or default]
router(config-router-af-interface)# passive-interface
router(config-router-af-interface)# no passive-interface
router(config-router-af-interface)# authentication mode hmac-sha256 [Key]
router(config-router-af-interface)# summary-address [IP] [Subnet Mask]

```

### â–¶ í† í´ë¡œì§€ ê´€ë ¨ ì„¤ì •

```bash
bash
ë³µì‚¬í¸ì§‘
router(config-router-af)# topology base
router(config-router-af-topology)# variance [Value]

```

---

## ğŸ“Œ ìš©ì–´ ì •ë¦¬ ë° ì°¸ê³ 

| í•­ëª© | ì„¤ëª… |
| --- | --- |
| **AS Number** | EIGRPì˜ ììœ¨ ì‹œìŠ¤í…œ ë²ˆí˜¸. ë™ì¼í•´ì•¼ ì¸ì ‘ ê°€ëŠ¥ |
| **Router-ID** | ë¼ìš°í„°ë¥¼ êµ¬ë¶„í•˜ëŠ” ê³ ìœ  ID. ë£¨í”„ë°±ì´ ì•ˆì •ì  |
| **Network ëª…ë ¹ì–´** | ë¼ìš°íŒ…í•  ë„¤íŠ¸ì›Œí¬ ë²”ìœ„ ì§€ì • |
| **Passive Interface** | ì¸ì ‘ í˜•ì„± X (ë¼ìš°íŒ…ì€ ìˆ˜í–‰) |
| **Hello/Hold Time** | ì¸ì ‘ ìœ ì§€ìš© íƒ€ì´ë¨¸ ì„¤ì • |
| **Bandwidth** | Metric ê³„ì‚° ê¸°ì¤€. kbps ë‹¨ìœ„ |
| **Summary Address** | ê²½ë¡œ ìš”ì•½ìœ¼ë¡œ ë¼ìš°íŒ… í…Œì´ë¸” ì¶•ì†Œ |
| **Variance** | Unequal-cost load balancing í—ˆìš©ê°’ |

---

## âœ… ì‹œê°ì  êµ¬ì„± ì˜ˆì‹œ ë¹„êµ

| í•­ëª© | Classic Mode | Named Mode |
| --- | --- | --- |
| ì„ ì–¸ ë°©ì‹ | `router eigrp 1` | `router eigrp CCNP` |
| ë„¤íŠ¸ì›Œí¬ ì„¤ì • | `network 10.0.0.0 0.0.0.255` | `address-family ipv4...` í•˜ìœ„ì—ì„œ ì„¤ì • |
| ì¸í„°í˜ì´ìŠ¤ ì„¤ì • | ì¸í„°í˜ì´ìŠ¤ ëª¨ë“œ ì§ì ‘ ì´ë™ | `af-interface` ë¸”ë¡ì—ì„œ ì„¤ì • |
| íŒ¨ì‹œë¸Œ ì¸í„°í˜ì´ìŠ¤ | `passive-interface default` | `af-interface default` ì•ˆì—ì„œ ì„¤ì • |
| ì¸ì¦ ì„¤ì • | ì–´ë ¤ì›€ | `authentication mode hmac-sha256` ëª…í™• |
| ìš”ì•½ ì„¤ì • | `ip summary-address eigrp...` | `summary-address ...` |
| í† í´ë¡œì§€ ì„¤ì • | ê¸°ë³¸ í¬í•¨ | `topology base` ëª…ì‹œ í•„ìš” |