---
layout: post
title: "cli 명령어"
date: 2025-08-10
categories:
  - "CISCO_STUDY/Quick Guide"
tags:
---


# cli 명령어

## 📁 1. 기본 CLI 조작

| 명령어 | 설명 |
| --- | --- |
| `enable` | 사용자 모드 → 특권 모드 전환 |
| `configure terminal` | 설정 모드로 진입 |
| `exit` | 한 단계 상위 모드로 나감 |
| `disable` | 특권 모드 → 사용자 모드 |
| `hostname [이름]` | 장비 이름 변경 |
| `banner motd #메시지#` | 로그인 시 표시되는 메시지 설정 |

---

## 🔍 2. 상태 확인 (show)

| 명령어 | 설명 |
| --- | --- |
| `show running-config` | 현재 설정 확인 (RAM) |
| `show startup-config` | 부팅 시 적용되는 설정 (NVRAM) |
| `show ip interface brief` | IP 할당 여부, 인터페이스 상태 요약 |
| `show interfaces` | 인터페이스의 상세 상태, 트래픽 등 |
| `show version` | IOS 버전, 장비 정보, 업타임 등 |
| `show vlan brief` | VLAN 구성 정보 |
| `show mac address-table` | MAC 주소 테이블 확인 (스위치) |
| `show arp` | ARP 캐시 확인 |
| `show cdp neighbors` | 인접 장비 정보 (CDP 활성화 시) |
| `show clock` | 현재 시스템 시간 |

---

## 🌐 3. IP 설정 관련

### 인터페이스 설정

```bash
bash
복사편집
configure terminal
interface g0/1
ip address 192.168.1.1 255.255.255.0
no shutdown
exit

```

| 명령어 | 설명 |
| --- | --- |
| `interface [인터페이스명]` | 인터페이스 설정 진입 |
| `ip address [IP] [서브넷]` | IP 주소 설정 |
| `no shutdown` | 인터페이스 활성화 |
| `shutdown` | 인터페이스 비활성화 |

---

## 📦 4. VLAN 및 스위치 관련

```bash
bash
복사편집
vlan 10
name IT
exit
interface fa0/1
switchport mode access
switchport access vlan 10

```

| 명령어 | 설명 |
| --- | --- |
| `vlan [번호]` | VLAN 생성 |
| `name [이름]` | VLAN 이름 설정 |
| `switchport mode access` | 포트를 액세스 모드로 |
| `switchport access vlan [번호]` | 해당 포트를 VLAN에 할당 |
| `switchport mode trunk` | 트렁크 모드 설정 |

---

## 📡 5. 라우팅 설정

### 정적 라우팅

```bash
bash
복사편집
ip route 0.0.0.0 0.0.0.0 192.168.1.1

```

| 명령어 | 설명 |
| --- | --- |
| `ip route [목적지] [서브넷] [게이트웨이]` | 정적 경로 추가 |
| `show ip route` | 라우팅 테이블 확인 |

---

### 동적 라우팅 (RIP 예시)

```bash
bash
복사편집
router rip
version 2
network 192.168.1.0

```

---

## ⏰ 6. NTP, DNS, 기본 설정

```bash
bash
복사편집
clock set 10:00:00 27 JUN 2025
ip name-server 8.8.8.8
ntp server 192.168.0.100

```

| 명령어 | 설명 |
| --- | --- |
| `clock set [시간] [날짜]` | 수동 시간 설정 |
| `ip name-server [DNS IP]` | DNS 서버 설정 |
| `ntp server [IP]` | NTP 서버 등록 |

---

## 🔐 7. 보안 및 접근 제어

| 명령어 | 설명 |
| --- | --- |
| `enable secret [비밀번호]` | 암호화된 enable 비밀번호 설정 |
| `line console 0` | 콘솔 라인 설정 진입 |
| `password [비번]` + `login` | 콘솔/텔넷 로그인 비밀번호 설정 |
| `service password-encryption` | 평문 비밀번호 암호화 |

---

## 🛠 8. 저장 및 복원

| 명령어 | 설명 |
| --- | --- |
| `copy running-config startup-config` | 현재 설정 저장 |
| `write memory` | 위와 동일 (구버전 명령어) |
| `reload` | 장비 재부팅 |
| `erase startup-config`  | 설정 초기화 |
| `delete vlan.dat` | [설정 스위치 초기화 필수] |

---

## ✅ 보너스: 명령어 편의 기능

| 키 입력 | 설명 |
| --- | --- |
| `TAB` | 자동 완성 |
| `?` | 가능한 명령어 목록 표시 |
| `Ctrl+C` | 실행 중인 명령 취소 |
| `Ctrl+Z` | 설정 모드 종료 + 특권 모드 복귀 |
| `show history` | 이전 명령 목록 보기 |
| 위/아래 방향키 | 명령어 히스토리 탐색 |

---

## 🧠 외워두면 좋은 대표 명령 세트 (인터페이스 설정 예시)

```bash
bash
복사편집
enable
configure terminal
interface g0/0
ip address 192.168.1.1 255.255.255.0
no shutdown
exit
copy running-config startup-config

```

## ✅ Cisco IOS 설정 정리

### 📌 1. DCE - DTE 간 클럭 설정

- DCE 장비는 클럭을 제공해야 하며, 이를 위해 **clock rate** 설정 필요:
    
    ```bash
    bash
    복사편집
    R1(config-if)#clock rate 64000
    
    ```
    

---

### 📌 2. VTY (원격접속, Telnet/SSH) 기본 설정

- Telnet 접근용 비밀번호 설정:
    
    ```bash
    bash
    복사편집
    R1(config)#line vty 0 4
    R1(config-line)#password cisco
    R1(config-line)#login
    
    ```
    
- **로컬 사용자 인증 방식**으로 전환 (username 등록 필요):
    
    ```bash
    bash
    복사편집
    R1(config)#username cisco password 1234
    R1(config)#line vty 0 4
    R1(config-line)#login local
    
    ```
    

---

### +

📌 3. 사용자 권한 설정 (Privilege Level)

- 사용자 권한은 0~15 단계:
- `0`, `1` → 기본권한 (명령 제한 많음)
- 생략시 privilege는 1 enable시 15
- `2~14` → 중간 관리자 권한
- `15` → 최고 관리자 (enable 모드)
- 특정 권한 사용자 추가:
    
    ```bash
    bash
    복사편집
    R1(config)#username user1 privilege 3 password cisco
    
    ```
    

---

### 📌 4. 패스워드 암호화

- 텍스트 형태의 패스워드 암호화:
    
    ```bash
    bash
    복사편집
    R1(config)#service password-encryption
    
    ```
    

---

### 📌 5. 기타 기본 설정

- **Ctrl+Shift+6**: 명령 중지
- **도메인 이름 잘못 입력 방지**:
    
    ```bash
    bash
    복사편집
    R1(config)#no ip domain lookup
    
    ```
    
- 콘솔 환경 개선:
    
    ```bash
    bash
    복사편집
    R1(config)#line console 0
    R1(config-line)#logging synchronous     ← 로그 중간 끊김 방지
    R1(config-line)#exec-timeout 0          ← 타임아웃 없음
    
    ```
    

---

### 📌 6. SSH 설정

- **SSH는 HTTPS와 비슷하게 Telnet보다 안전**
    
    ```
    nginx
    복사편집
    HTTP → HTTPS
    Telnet → SSH
    
    ```
    

### SSH 설정 순서

> ⚠️ Hostname과 domain-name 둘 다 설정해야 RSA 키 생성 가능
> 
1. 호스트 이름 및 도메인 네임 설정
    
    ```bash
    bash
    복사편집
    R1(config)#hostname R1
    R1(config)#ip domain-name cisco.com
    
    ㅁ
    ```
    
2. RSA 키 생성 (SSH는 RSA 기반)
    
    ```bash
    bash
    복사편집
    R1(config)#crypto key generate rsa
    How many bits in the modulus [512]: 1024
    
    ```
    
3. 사용자 등록
    
    ```bash
    bash
    복사편집
    R1(config)#username admin password cisco
    
    ```
    
4. SSH 설정 마무리
    
    ```bash
    bash
    복사편집
    R1(config)#ip ssh version 2
    R1(config)#line vty 0 4
    R1(config-line)#login local
    R1(config-line)#transport input ssh
    
    ```
    

> 💡 SSH Version 2는 RSA 1024비트 이상만 지원
> 

---

### 📌 7. Syslog 및 NTP 설정

### Syslog 서버 등록

- 라우터에서 로그를 외부 서버로 전송:
    
    ```bash
    bash
    복사편집
    Router(config)#logging 203.230.7.2
    Router(config)#service timestamps log datetime msec
    
    ```
    

### NTP 서버 설정

- 정확한 시간 동기화를 위해 NTP 필요 (최근 기능 정상작동 위해 필요):
    
    ```bash
    bash
    복사편집
    Router(config)#ntp server 203.230.7.2
    
    ```
    

---

### 📌 8. 기타 참고 사항

- *이벤트 메시지 (Syslog)**는 **숫자가 작을수록 긴급**:
    - 0: Emergency (시스템 다운)
    - 7: Debug (최하위 우선순위)
- **+`자동화는 대부분 SSH 기반** (보안성 및 원격 제어 가능)

---

---

---

---

---

---

`

---

---

—

dce(clock rate)->dte
r1(config-if)#clock rate 64000

r1(config)#line vty 0 4
r1(config-line)#password cisco
r1(config-line)#login
r1(config-line)#exit

r1(config)#username cisco password 1234
r1(config)#line vty 0 4
r1(config-line)#login local
r1(config-line)#exit

r1(config)#username user1 privilege 3 password cisco
r1(config)#service password-encryption

ctrl shift 6
r1(config)#no ip domain lookup

라우터의 이름이 기본이면 키생성이 안됨
r1#conf t
r1(config)#ip domain-name [cisco.com](http://cisco.com/)
r1(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
r1(config)#username admin password cisco
r1(config)#ip ssh version 2
r1(config)#line vty 0 4
r1(config-line)#login local
r1(config-line)#transport input ssh
r1(config-line)#exit

r1(config)#line console 0
r1(config-line)#logging synchronous
r1(config-line)#exec-timeout 0

http->https = telnet->ssh

1 priviliage [enablepass]-> level 15승격
2-14 바로 관리자

event message sys 숫자가낮을수록 긴급한메시지

router ntp 설정해야 정상작동함 (최근임)

Router(config)#logging 203.230.7.2
Router(config)#service timestamps log datetime msec
#ntp server 203.230.7.2

[line console 0,password 1111,login]

ssh rsa 키 제네레이션에 hostname domain-name이 쓰여서 필요하다!

ssh version 2는 rsa1024이상만쓸수있다

자동화는 전부 ssh 이용

int loopback 0

int addr 1.1.1.1 255.255.255.0

int addr 1.1.1.2 255.255.255.0 secon

router rip

network 10.0.0.0

no auto-summary

config-int) ip summary-address rip

passive-interface

(l3)ip default-gateway

config-router)default-information originate

no auto-summary

key chain cisco

key 7

key-string 1029

int fa,gi

ip rip authen mode md5

ip rip authen key-chain cicso

int loo

[cli 명령어 0707v](cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2021ff2235217380f481dce3bdf26c2e3d/cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%200707v%20229f2235217380949e61fb75391ea568.md)

[cli 명령어 0707v 공유](cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2021ff2235217380f481dce3bdf26c2e3d/cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%200707v%20%E1%84%80%E1%85%A9%E1%86%BC%E1%84%8B%E1%85%B2%20229f2235217380389922d2bb430f728b.md)

[EIGRP 명령어](cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2021ff2235217380f481dce3bdf26c2e3d/EIGRP%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2022cf2235217380c89c92d4ffe5e99da4.md)