---
layout: post
title: "cli ëª…ë ¹ì–´"
date: 2025-08-10
categories:
  - "CISCO_STUDY/Quick Guide"
tags:
---


# cli ëª…ë ¹ì–´

## ğŸ“ 1. ê¸°ë³¸ CLI ì¡°ì‘

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `enable` | ì‚¬ìš©ì ëª¨ë“œ â†’ íŠ¹ê¶Œ ëª¨ë“œ ì „í™˜ |
| `configure terminal` | ì„¤ì • ëª¨ë“œë¡œ ì§„ì… |
| `exit` | í•œ ë‹¨ê³„ ìƒìœ„ ëª¨ë“œë¡œ ë‚˜ê° |
| `disable` | íŠ¹ê¶Œ ëª¨ë“œ â†’ ì‚¬ìš©ì ëª¨ë“œ |
| `hostname [ì´ë¦„]` | ì¥ë¹„ ì´ë¦„ ë³€ê²½ |
| `banner motd #ë©”ì‹œì§€#` | ë¡œê·¸ì¸ ì‹œ í‘œì‹œë˜ëŠ” ë©”ì‹œì§€ ì„¤ì • |

---

## ğŸ” 2. ìƒíƒœ í™•ì¸ (show)

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `show running-config` | í˜„ì¬ ì„¤ì • í™•ì¸ (RAM) |
| `show startup-config` | ë¶€íŒ… ì‹œ ì ìš©ë˜ëŠ” ì„¤ì • (NVRAM) |
| `show ip interface brief` | IP í• ë‹¹ ì—¬ë¶€, ì¸í„°í˜ì´ìŠ¤ ìƒíƒœ ìš”ì•½ |
| `show interfaces` | ì¸í„°í˜ì´ìŠ¤ì˜ ìƒì„¸ ìƒíƒœ, íŠ¸ë˜í”½ ë“± |
| `show version` | IOS ë²„ì „, ì¥ë¹„ ì •ë³´, ì—…íƒ€ì„ ë“± |
| `show vlan brief` | VLAN êµ¬ì„± ì •ë³´ |
| `show mac address-table` | MAC ì£¼ì†Œ í…Œì´ë¸” í™•ì¸ (ìŠ¤ìœ„ì¹˜) |
| `show arp` | ARP ìºì‹œ í™•ì¸ |
| `show cdp neighbors` | ì¸ì ‘ ì¥ë¹„ ì •ë³´ (CDP í™œì„±í™” ì‹œ) |
| `show clock` | í˜„ì¬ ì‹œìŠ¤í…œ ì‹œê°„ |

---

## ğŸŒ 3. IP ì„¤ì • ê´€ë ¨

### ì¸í„°í˜ì´ìŠ¤ ì„¤ì •

```bash
bash
ë³µì‚¬í¸ì§‘
configure terminal
interface g0/1
ip address 192.168.1.1 255.255.255.0
no shutdown
exit

```

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `interface [ì¸í„°í˜ì´ìŠ¤ëª…]` | ì¸í„°í˜ì´ìŠ¤ ì„¤ì • ì§„ì… |
| `ip address [IP] [ì„œë¸Œë„·]` | IP ì£¼ì†Œ ì„¤ì • |
| `no shutdown` | ì¸í„°í˜ì´ìŠ¤ í™œì„±í™” |
| `shutdown` | ì¸í„°í˜ì´ìŠ¤ ë¹„í™œì„±í™” |

---

## ğŸ“¦ 4. VLAN ë° ìŠ¤ìœ„ì¹˜ ê´€ë ¨

```bash
bash
ë³µì‚¬í¸ì§‘
vlan 10
name IT
exit
interface fa0/1
switchport mode access
switchport access vlan 10

```

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `vlan [ë²ˆí˜¸]` | VLAN ìƒì„± |
| `name [ì´ë¦„]` | VLAN ì´ë¦„ ì„¤ì • |
| `switchport mode access` | í¬íŠ¸ë¥¼ ì•¡ì„¸ìŠ¤ ëª¨ë“œë¡œ |
| `switchport access vlan [ë²ˆí˜¸]` | í•´ë‹¹ í¬íŠ¸ë¥¼ VLANì— í• ë‹¹ |
| `switchport mode trunk` | íŠ¸ë í¬ ëª¨ë“œ ì„¤ì • |

---

## ğŸ“¡ 5. ë¼ìš°íŒ… ì„¤ì •

### ì •ì  ë¼ìš°íŒ…

```bash
bash
ë³µì‚¬í¸ì§‘
ip route 0.0.0.0 0.0.0.0 192.168.1.1

```

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `ip route [ëª©ì ì§€] [ì„œë¸Œë„·] [ê²Œì´íŠ¸ì›¨ì´]` | ì •ì  ê²½ë¡œ ì¶”ê°€ |
| `show ip route` | ë¼ìš°íŒ… í…Œì´ë¸” í™•ì¸ |

---

### ë™ì  ë¼ìš°íŒ… (RIP ì˜ˆì‹œ)

```bash
bash
ë³µì‚¬í¸ì§‘
router rip
version 2
network 192.168.1.0

```

---

## â° 6. NTP, DNS, ê¸°ë³¸ ì„¤ì •

```bash
bash
ë³µì‚¬í¸ì§‘
clock set 10:00:00 27 JUN 2025
ip name-server 8.8.8.8
ntp server 192.168.0.100

```

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `clock set [ì‹œê°„] [ë‚ ì§œ]` | ìˆ˜ë™ ì‹œê°„ ì„¤ì • |
| `ip name-server [DNS IP]` | DNS ì„œë²„ ì„¤ì • |
| `ntp server [IP]` | NTP ì„œë²„ ë“±ë¡ |

---

## ğŸ” 7. ë³´ì•ˆ ë° ì ‘ê·¼ ì œì–´

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `enable secret [ë¹„ë°€ë²ˆí˜¸]` | ì•”í˜¸í™”ëœ enable ë¹„ë°€ë²ˆí˜¸ ì„¤ì • |
| `line console 0` | ì½˜ì†” ë¼ì¸ ì„¤ì • ì§„ì… |
| `password [ë¹„ë²ˆ]` + `login` | ì½˜ì†”/í…”ë„· ë¡œê·¸ì¸ ë¹„ë°€ë²ˆí˜¸ ì„¤ì • |
| `service password-encryption` | í‰ë¬¸ ë¹„ë°€ë²ˆí˜¸ ì•”í˜¸í™” |

---

## ğŸ›  8. ì €ì¥ ë° ë³µì›

| ëª…ë ¹ì–´ | ì„¤ëª… |
| --- | --- |
| `copy running-config startup-config` | í˜„ì¬ ì„¤ì • ì €ì¥ |
| `write memory` | ìœ„ì™€ ë™ì¼ (êµ¬ë²„ì „ ëª…ë ¹ì–´) |
| `reload` | ì¥ë¹„ ì¬ë¶€íŒ… |
| `erase startup-config`  | ì„¤ì • ì´ˆê¸°í™” |
| `delete vlan.dat` | [ì„¤ì • ìŠ¤ìœ„ì¹˜ ì´ˆê¸°í™” í•„ìˆ˜] |

---

## âœ… ë³´ë„ˆìŠ¤: ëª…ë ¹ì–´ í¸ì˜ ê¸°ëŠ¥

| í‚¤ ì…ë ¥ | ì„¤ëª… |
| --- | --- |
| `TAB` | ìë™ ì™„ì„± |
| `?` | ê°€ëŠ¥í•œ ëª…ë ¹ì–´ ëª©ë¡ í‘œì‹œ |
| `Ctrl+C` | ì‹¤í–‰ ì¤‘ì¸ ëª…ë ¹ ì·¨ì†Œ |
| `Ctrl+Z` | ì„¤ì • ëª¨ë“œ ì¢…ë£Œ + íŠ¹ê¶Œ ëª¨ë“œ ë³µê·€ |
| `show history` | ì´ì „ ëª…ë ¹ ëª©ë¡ ë³´ê¸° |
| ìœ„/ì•„ë˜ ë°©í–¥í‚¤ | ëª…ë ¹ì–´ íˆìŠ¤í† ë¦¬ íƒìƒ‰ |

---

## ğŸ§  ì™¸ì›Œë‘ë©´ ì¢‹ì€ ëŒ€í‘œ ëª…ë ¹ ì„¸íŠ¸ (ì¸í„°í˜ì´ìŠ¤ ì„¤ì • ì˜ˆì‹œ)

```bash
bash
ë³µì‚¬í¸ì§‘
enable
configure terminal
interface g0/0
ip address 192.168.1.1 255.255.255.0
no shutdown
exit
copy running-config startup-config

```

## âœ… Cisco IOS ì„¤ì • ì •ë¦¬

### ğŸ“Œ 1. DCE - DTE ê°„ í´ëŸ­ ì„¤ì •

- DCE ì¥ë¹„ëŠ” í´ëŸ­ì„ ì œê³µí•´ì•¼ í•˜ë©°, ì´ë¥¼ ìœ„í•´ **clock rate** ì„¤ì • í•„ìš”:
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config-if)#clock rate 64000
    
    ```
    

---

### ğŸ“Œ 2. VTY (ì›ê²©ì ‘ì†, Telnet/SSH) ê¸°ë³¸ ì„¤ì •

- Telnet ì ‘ê·¼ìš© ë¹„ë°€ë²ˆí˜¸ ì„¤ì •:
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#line vty 0 4
    R1(config-line)#password cisco
    R1(config-line)#login
    
    ```
    
- **ë¡œì»¬ ì‚¬ìš©ì ì¸ì¦ ë°©ì‹**ìœ¼ë¡œ ì „í™˜ (username ë“±ë¡ í•„ìš”):
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#username cisco password 1234
    R1(config)#line vty 0 4
    R1(config-line)#login local
    
    ```
    

---

### +

ğŸ“Œ 3. ì‚¬ìš©ì ê¶Œí•œ ì„¤ì • (Privilege Level)

- ì‚¬ìš©ì ê¶Œí•œì€ 0~15 ë‹¨ê³„:
- `0`, `1` â†’ ê¸°ë³¸ê¶Œí•œ (ëª…ë ¹ ì œí•œ ë§ìŒ)
- ìƒëµì‹œ privilegeëŠ” 1 enableì‹œ 15
- `2~14` â†’ ì¤‘ê°„ ê´€ë¦¬ì ê¶Œí•œ
- `15` â†’ ìµœê³  ê´€ë¦¬ì (enable ëª¨ë“œ)
- íŠ¹ì • ê¶Œí•œ ì‚¬ìš©ì ì¶”ê°€:
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#username user1 privilege 3 password cisco
    
    ```
    

---

### ğŸ“Œ 4. íŒ¨ìŠ¤ì›Œë“œ ì•”í˜¸í™”

- í…ìŠ¤íŠ¸ í˜•íƒœì˜ íŒ¨ìŠ¤ì›Œë“œ ì•”í˜¸í™”:
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#service password-encryption
    
    ```
    

---

### ğŸ“Œ 5. ê¸°íƒ€ ê¸°ë³¸ ì„¤ì •

- **Ctrl+Shift+6**: ëª…ë ¹ ì¤‘ì§€
- **ë„ë©”ì¸ ì´ë¦„ ì˜ëª» ì…ë ¥ ë°©ì§€**:
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#no ip domain lookup
    
    ```
    
- ì½˜ì†” í™˜ê²½ ê°œì„ :
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#line console 0
    R1(config-line)#logging synchronous     â† ë¡œê·¸ ì¤‘ê°„ ëŠê¹€ ë°©ì§€
    R1(config-line)#exec-timeout 0          â† íƒ€ì„ì•„ì›ƒ ì—†ìŒ
    
    ```
    

---

### ğŸ“Œ 6. SSH ì„¤ì •

- **SSHëŠ” HTTPSì™€ ë¹„ìŠ·í•˜ê²Œ Telnetë³´ë‹¤ ì•ˆì „**
    
    ```
    nginx
    ë³µì‚¬í¸ì§‘
    HTTP â†’ HTTPS
    Telnet â†’ SSH
    
    ```
    

### SSH ì„¤ì • ìˆœì„œ

> âš ï¸ Hostnameê³¼ domain-name ë‘˜ ë‹¤ ì„¤ì •í•´ì•¼ RSA í‚¤ ìƒì„± ê°€ëŠ¥
> 
1. í˜¸ìŠ¤íŠ¸ ì´ë¦„ ë° ë„ë©”ì¸ ë„¤ì„ ì„¤ì •
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#hostname R1
    R1(config)#ip domain-name cisco.com
    
    ã…
    ```
    
2. RSA í‚¤ ìƒì„± (SSHëŠ” RSA ê¸°ë°˜)
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#crypto key generate rsa
    How many bits in the modulus [512]: 1024
    
    ```
    
3. ì‚¬ìš©ì ë“±ë¡
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#username admin password cisco
    
    ```
    
4. SSH ì„¤ì • ë§ˆë¬´ë¦¬
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    R1(config)#ip ssh version 2
    R1(config)#line vty 0 4
    R1(config-line)#login local
    R1(config-line)#transport input ssh
    
    ```
    

> ğŸ’¡ SSH Version 2ëŠ” RSA 1024ë¹„íŠ¸ ì´ìƒë§Œ ì§€ì›
> 

---

### ğŸ“Œ 7. Syslog ë° NTP ì„¤ì •

### Syslog ì„œë²„ ë“±ë¡

- ë¼ìš°í„°ì—ì„œ ë¡œê·¸ë¥¼ ì™¸ë¶€ ì„œë²„ë¡œ ì „ì†¡:
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    Router(config)#logging 203.230.7.2
    Router(config)#service timestamps log datetime msec
    
    ```
    

### NTP ì„œë²„ ì„¤ì •

- ì •í™•í•œ ì‹œê°„ ë™ê¸°í™”ë¥¼ ìœ„í•´ NTP í•„ìš” (ìµœê·¼ ê¸°ëŠ¥ ì •ìƒì‘ë™ ìœ„í•´ í•„ìš”):
    
    ```bash
    bash
    ë³µì‚¬í¸ì§‘
    Router(config)#ntp server 203.230.7.2
    
    ```
    

---

### ğŸ“Œ 8. ê¸°íƒ€ ì°¸ê³  ì‚¬í•­

- *ì´ë²¤íŠ¸ ë©”ì‹œì§€ (Syslog)**ëŠ” **ìˆ«ìê°€ ì‘ì„ìˆ˜ë¡ ê¸´ê¸‰**:
    - 0: Emergency (ì‹œìŠ¤í…œ ë‹¤ìš´)
    - 7: Debug (ìµœí•˜ìœ„ ìš°ì„ ìˆœìœ„)
- **+`ìë™í™”ëŠ” ëŒ€ë¶€ë¶„ SSH ê¸°ë°˜** (ë³´ì•ˆì„± ë° ì›ê²© ì œì–´ ê°€ëŠ¥)

---

---

---

---

---

---

`

---

---

â€”

dce(clock rate)->dte
r1(config-if)#clock rate 64000

r1(config)#line vty 0 4
r1(config-line)#password cisco
r1(config-line)#login
r1(config-line)#exit

r1(config)#username cisco password 1234
r1(config)#line vty 0 4
r1(config-line)#login local
r1(config-line)#exit

r1(config)#username user1 privilege 3 password cisco
r1(config)#service password-encryption

ctrl shift 6
r1(config)#no ip domain lookup

ë¼ìš°í„°ì˜ ì´ë¦„ì´ ê¸°ë³¸ì´ë©´ í‚¤ìƒì„±ì´ ì•ˆë¨
r1#conf t
r1(config)#ip domain-name [cisco.com](http://cisco.com/)
r1(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
r1(config)#username admin password cisco
r1(config)#ip ssh version 2
r1(config)#line vty 0 4
r1(config-line)#login local
r1(config-line)#transport input ssh
r1(config-line)#exit

r1(config)#line console 0
r1(config-line)#logging synchronous
r1(config-line)#exec-timeout 0

http->https = telnet->ssh

1 priviliage [enablepass]-> level 15ìŠ¹ê²©
2-14 ë°”ë¡œ ê´€ë¦¬ì

event message sys ìˆ«ìê°€ë‚®ì„ìˆ˜ë¡ ê¸´ê¸‰í•œë©”ì‹œì§€

router ntp ì„¤ì •í•´ì•¼ ì •ìƒì‘ë™í•¨ (ìµœê·¼ì„)

Router(config)#logging 203.230.7.2
Router(config)#service timestamps log datetime msec
#ntp server 203.230.7.2

[line console 0,password 1111,login]

ssh rsa í‚¤ ì œë„¤ë ˆì´ì…˜ì— hostname domain-nameì´ ì“°ì—¬ì„œ í•„ìš”í•˜ë‹¤!

ssh version 2ëŠ” rsa1024ì´ìƒë§Œì“¸ìˆ˜ìˆë‹¤

ìë™í™”ëŠ” ì „ë¶€ ssh ì´ìš©

int loopback 0

int addr 1.1.1.1 255.255.255.0

int addr 1.1.1.2 255.255.255.0 secon

router rip

network 10.0.0.0

no auto-summary

config-int) ip summary-address rip

passive-interface

(l3)ip default-gateway

config-router)default-information originate

no auto-summary

key chain cisco

key 7

key-string 1029

int fa,gi

ip rip authen mode md5

ip rip authen key-chain cicso

int loo

[cli ëª…ë ¹ì–´ 0707v](cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2021ff2235217380f481dce3bdf26c2e3d/cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%200707v%20229f2235217380949e61fb75391ea568.md)

[cli ëª…ë ¹ì–´ 0707v ê³µìœ ](cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2021ff2235217380f481dce3bdf26c2e3d/cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%200707v%20%E1%84%80%E1%85%A9%E1%86%BC%E1%84%8B%E1%85%B2%20229f2235217380389922d2bb430f728b.md)

[EIGRP ëª…ë ¹ì–´](cli%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2021ff2235217380f481dce3bdf26c2e3d/EIGRP%20%E1%84%86%E1%85%A7%E1%86%BC%E1%84%85%E1%85%A7%E1%86%BC%E1%84%8B%E1%85%A5%2022cf2235217380c89c92d4ffe5e99da4.md)