---
layout: post
title: "eigrp 명령어"
date: 2025-08-10
categories:
  - "CISCO_STUDY/Quick Guide/EIGRP"
tags:
---



# eigrp 명령어

# Classic

router(config)# router eigrp [as number]

router(config-router)# eigrp router-id [ip addres(loopback)]

router(config-router)# network [ip addres] [subnet]

router(config-router)# passive-interface default

router(config-router)# no passive-interface [interface]

show ip eigrp interfaces

show  ip eigrp topology all-links

router(config-if)# ip hello-interval eigrp [as number] [time]

router(config-if)# ip hold-time eigrp [as number] [time]

router(config-interface)# bandwith [value]

router(config-interface)#ip  summary-address aigrp [as number] [ip] [subnet]

# Named eigrp

router(config)# router eigrp [name]

router(config-router)# address-family ipv4 unicast autonomous-system [number]

router(config-router-af)# network  [ip addres] [subnet]

router(config-router-af)# af-interface [interface  or default]

router(config-router-af-interface)# passive-interface

router(config-router-af-interface(or default))# no passive-interface

router(config-router-af-interface)# authentication mode hmac-sha256 [key]

router(config-router-af)# topology base

router(config-router-af-topology)# variance [value]

router(config-router-af-interface)# summary-address [ip] [subnet]

# Classic Ipv6 eigrp

router eigrp [이름]
address-family ipv6 unicast autonomous-system [AS 번호]
eigrp router-id [IPv4 address]
af-interface [인터페이스]
ipv6 enable
authentication mode hmac-sha-256
authentication key-chain [KEY-CHAIN 이름]
passive-interface
summary-address [IPv6 prefix] [prefix-length]
hello-interval [초]
hold-time [초]
topology base
variance [값]

# Named Ipv6 eigrp

router eigrp EIGRP-NAMED
address-family ipv6 unicast autonomous-system 100
eigrp router-id 1.1.1.1
af-interface g0/0
ipv6 enable
hello-interval 5
hold-time 15
authentication mode hmac-sha-256
authentication key-chain EIGRP-KEY
passive-interface
summary-address 2000:2000:2000:1:: 64
topology base
variance 2